CSI API ETABS v1

# cDCoMexican_RCDF_2017 Interface

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    public interface cDCoMexican_RCDF_2017

    Public Interface cDCoMexican_RCDF_2017

    Dim instance As cDCoMexican_RCDF_2017

    public interface class cDCoMexican_RCDF_2017

    type cDCoMexican_RCDF_2017 =  interface end

The cDCoMexican_RCDF_2017 type exposes the following members.

Methods

| Name| Description
---|---|---
|
GetOverwrite|  Retrieves the value
of a concrete design overwrite item.
|
GetPreference|  Retrieves the
value of a concrete design preference item.
|
SetOverwrite|  Sets the value of a
concrete design overwrite item.
|
SetPreference|  Sets the value of
a concrete design preference item.
Top

See Also

#### Reference

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com